#include<bits/stdc++.h>
using namespace std;
int mp[100][100]; //地图
int vis[100][100]; //标记数组
int n, m, ans; //n行m列 ans:统计有多少区域
int dx[4] = {1, 0, -1, 0}, dy[4] = {0, 1, 0, -1}; //下右上左
void dfs(int x, int y) {
    //从当前格子(x,y)开始深搜
    for (int i = 0; i < 4; i++) {
        int nx = x + dx[i];
        int ny = y + dy[i];
        if (nx > 0 && nx <= n && ny > 0 && ny <= m && mp[nx][ny] == 1 && vis[nx][ny] == 0) {
            vis[nx][ny] = 1; //标记已访问
            dfs(nx, ny);
        }
    }
}

int main() {
    cin >> n >> m; //n行m列
    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= m; j++)
            cin >> mp[i][j];
    }
    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= m; j++) {
            if (mp[i][j] == 1 && vis[i][j] == 0) {
                vis[i][j] = 1; //标记已访问
                dfs(i, j);
                ans++;
            }
        }
    }
    cout << ans;
    return 0;
}

/*
4 10
0 1 1 1 1 0 0 0 1 1
1 0 1 1 1 1 0 1 0 0
1 0 1 1 1 0 0 1 1 1
0 0 0 0 0 0 0 0 1 1
4

10 30
0 0 0 1 1 0 1 0 0 1 1 1 0 0 0 0 1 0 0 1 1 0 0 0 1 0 0 0 1 0
1 0 0 1 1 1 1 1 1 0 0 0 1 0 1 0 0 1 0 0 1 0 0 0 1 0 0 1 1 0
0 1 1 0 1 0 1 1 0 0 0 0 0 0 1 0 0 1 0 1 1 1 0 0 0 0 1 0 1 0
0 1 1 1 1 1 1 0 0 1 0 1 1 1 1 0 0 0 0 1 1 1 0 1 0 1 0 0 1 0
0 1 0 0 0 1 0 1 1 1 0 0 1 1 0 1 0 1 0 1 0 1 1 1 1 1 1 1 0 0
1 1 0 1 0 0 0 1 0 0 1 1 0 0 1 0 1 0 1 0 1 1 0 1 1 1 0 1 0 1
1 0 1 0 0 1 0 1 0 0 1 0 1 0 1 0 0 1 0 0 0 1 1 1 1 0 1 0 0 1
0 1 0 1 0 0 1 1 0 1 1 1 1 1 0 1 1 1 1 1 1 1 0 1 1 0 0 0 1 0
0 0 0 1 1 1 1 0 0 1 0 0 1 1 0 1 0 1 0 0 1 0 1 1 1 0 0 1 0 0
1 1 0 1 0 1 1 0 0 1 0 1 1 0 1 1 0 0 1 1 0 0 0 0 1 0 1 1 0 0
28

5 6
0 1 0 1 0 1
0 1 0 1 1 1
0 1 1 0 0 1
1 0 0 0 0 0
1 0 0 1 0 0
4
*/
