/*
一：补全代码 
题目描述：将8000秒表示成小时分钟秒的形式。
#include <iostream>
using namespace std;
int main(){
    int h, m, s;
	h  =  _________；
    m  = 8000/60%60;
	s   = 8000%60;
	cout << "8000秒=" << h << "小时" << m << "分" << s << "秒" << endl; 
	return 0;
}
1.横线处应该填写的代码是(     )
A 8000%60 B 8000/60  C 8000%3600  D 8000/3600
答案：

2.这段代码的输出结果是(     )
A 8000秒=2时13分20秒
B 2小时13分20秒
C 8000秒=2小时13分20秒
D 8000秒=2小时13分钟20秒 
答案：

二：程序编写题

题目名称：三位数123的逆序数
题目描述：给定一个三位数123，输出它的逆序数，输出321。
输入描述：无
输出描述：逆序之后的三位数。

样例输出：
321
*/
#include<iostream>

using namespace std;

int main() {

    return 0;
}
