# include <iostream>

using namespace std;

int main() {
    // // 定义一个整形的二维数组 a, 行长度是 2, 列长度是 3, 存储 6 个元素
    // int a[2][3];

    // // 定义二维数组 a, 并分行赋值
    // int a[3][4] = {{1, 2, 3, 4},
    //                {},
    //                {4, 6}};
    // // 访问下标为 1, 1 的元素
    // cout << a[1][1] << endl;
    // // 访问下标为 0, 2 的元素
    // cout << a[0][2] << endl;

    // // 顺序赋值
    // int b[4][4] = {1, 2, 3};
    // // 访问下标为 0, 2 的元素
    // cout << b[0][2] << endl;

    // // 部分元素赋值
    // int c[][3] = {1, 2, 3, 4, 5}; // 2 行 3 列
    // cout << c[1][2] << endl;
    // // 获取数值 5
    // cout << c[1][2] << endl;

    // // 二维数组初始化为 0
    // int b[4][4] = {};
    // cout << b[2][2] << endl;

    // // 获取小紫的英语成绩
    // double score[3][3] = {{90, 96,   92},
    //                       {94, 95.5, 90},
    //                       {96, 99,   89}};
    // // 获取小紫的英语成绩
    // cout << score[2][2] << endl;

    // // 声明二维数组存储学生的身高和体重信息
    // int info[2][2] = {{160, 45},
    //                   {150, 35}};
    // // 获取两位同学的身高和体重
    // cout << info[0][0] << endl;
    // cout << info[0][1] << endl;
    // cout << info[1][0] << endl;
    // cout << info[1][1] << endl;

    // return 0;
}