/*一：代码补全。
题目名称：温度表达转化
题目描述：利用公式 C = 5 * (F-32) / 9 （其中C表示摄氏温度，F表示华氏温度） 进行计算转化。
输入描述：输入一行，包含一个实数f，表示华氏温度。（f >= -459.67）
输出描述：输出一行，包含一个实数，表示对应的摄氏温度，要求精确到小数点后5位。
#include<iostream>
#include<____1_____>
using namespace std;
int main(){
	double f,c;
	cin >> f;
	c=5*(f-32)/9;
	cout << ___2__ << ____3___ << c << endl;
	return 0;
}
横线1处应填写的代码是
答案： 

横线2处应填写的代码是
答案：

横线3处应填写的代码是
答案：

二：程序编写题。
题目名称：等差数列末项
题目描述：描述给出一个等差数列的前两项a1，a2，求第n项是多少。
输入描述：一行，包含三个整数a1，a2，n。-100 <= a1,a2 <= 100，0 < n <= 1000。
输出描述：一个整数，即第n项的值。
样例输入：
1 4 100
样例输出：
298
*/
#include<iostream>

using namespace std;

int main() {

    return 0;
}


